from rest_framework import serializers

ERRORS = {
    "01_01": "Пробіг не може бути меншим за нуль",
    "01_02": "Новий пробіг не може бути меншим за попередній",
    "03_01": "Фізична особа обов'язково має мати ідентифікаційний код",
    "03_02": "ФОП обов'язково має мати ідентифікаційний код",
    "03_03": "Компанія обов'язково має мати ЄРДПОУ",
    "03_04": "Компанія повинна мати представника",
    "06_01": "Водій в поїздці. Назначте іншого водія",
    "06_02": "Не можливо змінити водія під час поїздки",
    "06_03": "Транспорт в дорозі. Назначте інший транспорт",
    "06_04": "Транспорт потребує ТО/Ремонту",
    "06_05": "Транспорт на ТО/Ремонті",
    "06_06": "Не можливо змінити транспорт під час поїздки",
    "06_07": "Замовлення вже доставляється",
    "06_08": "Замовлення вже виконане",
    "06_09": "Не можливо змінити замовлення під час поїздки",
}

def error_response(error_code: str):
    return {"error": {"code": error_code, "message": ERRORS[error_code]}}